[
    {
        "number": 1,
        "pattern": "111111",
        "name": {
            "chinese": "乾",
            "pinyin": "qián",
            "english": "The Creative Force"
        },
        "symbol": "䷀",
        "quote": "I must Create a System, or be enslaved by another Man's;\nI will not Reason and Compare; my business is to Create.",
        "quoteAuthor": "William Blake",
        "desc": "Success is assured when you draw this hexagram. Provided that your goals are worthwhile and not merely selfish, significant achievement is possible. Make this a time of great activity. Use your initiative to set your plans in motion. Others will look to you to take the lead. A high level of confidence will give you abundant energy. Use this for the benefit of all concerned. You can find creative ways to resolve problems and accomplish ambitious goals. Look ahead. Be aware of the consequences of your actions. Good timing is essential. Do not allow yourself to be pressured into taking action prematurely. Consolidate your position of strength by refusing to waste your resources on trivial or irrelevant issues. Be positive and determined to achieve your aims. Do not get involved in anything unworthy of you. This is a most favourable time. Be sure to make the most of it.",
        "descPersonal": "Dynamic energy, unless it is used wisely, can be destructive. The more power you have, the more careful you must be not to abuse it. In the current situation, you are in a position of considerable influence. Direct this to positive ends and you will be a source of inspiration to others. Use it negatively and you could create havoc. Take responsibility for your actions. Be supportive of others. Beware of over-ambition and excessive pride. Be especially sensitive to other people's feelings. Take their views seriously. Be kind and tolerant. If matters do not go exactly according to plan, be patient. Guard against arrogance and look for opportunities to learn.",
        "furtherAspects": [
            [
                1,
                "Be patient. The time is not yet ripe for action. As yet you do not fully understand what is involved. Wait until matters become clear. Until then, keep a low profile."
            ],
            [
                2,
                "Aim high. Your abilities qualify you to make a major contribution to the situation. But you are not yet in a position where your value can be fully appreciated. It would be to your great advantage to cooperate with somebody who is already involved in your field of interest."
            ],
            [
                3,
                "New opportunities are offered. With your goals firmly in mind, make careful choices based on what feels right for you. Do not be concerned about pleasing others or trying to satisfy their needs. Know your priorities and refuse to be side-tracked. Do not be over-ambitious."
            ],
            [
                4,
                "You are at a crossroads. You can take a higher profile in the situation or withdraw from it so as to pursue other interests. Neither path is in itself better than the other. Your choice depends on what best suits your temperament. If you are true to yourself and follow your intuition, you will make the right decision."
            ],
            [
                5,
                "This is one of the most favourable positions of all. It indicates that you can accomplish almost anything. Make full use of all your resources. Aim high and do the very best you can. You have considerable influence. Use it well."
            ],
            [
                6,
                "You have become too ambitious. If you push matters any further you will lose touch with reality. You have to know when to hold back. This will protect you from the danger of going to extremes. Remember that pride comes before a fall."
            ]
        ]
    },
    {
        "number": 22,
        "pattern": "101001",
        "name": {
            "chinese": "賁",
            "pinyin": "bì",
            "english": "Adornment"
        },
        "symbol": "䷕",
        "quote": "'If you get simple beauty and naught else,\nYou get about the best thing God invents.'",
        "quoteAuthor": "Robert Browning",
        "desc": "You can influence the situation only in small ways. Use tact and charm. Present yourself in the best possible light. Make the most of your assets and your abilities. You may want to make minor changes in your environment so that it more accurately reflects your personality and your tastes. But keep your priorities straight. Do not be conceited or self-indulgent. If you do not value yourself as you are, no amount of material possessions or designer clothes will help to give you a sense of worth. Remember that true beauty, like true happiness, comes from within. An attractive appearance is of little value if it merely disguises a selfish nature. The most elegant surroundings in the world will not bring joy if their owners live in an atmosphere of ill-will.",
        "descPersonal": "Each of us projects an image of how we would like to be seen by others. The psychologist Carl Jung called this the persona. A charming and attractive persona is unquestionably a great asset. But it is only one aspect of you, not the whole picture. If you are so involved with your image that you neglect your self-development, your life will become meaningless and superficial.\nThe consequences of putting too much value on appearances are the subject of the novel by Oscar Wilde, The Picture of Dorian Gray. Here the main character manages to preserve his youthful beauty for many years. But he fails to develop any strength of character in the meantime. When his outer mask finally drops away, no trace of physical beauty remains in this once-exquisite face, now ravaged by time and self-indulgence.",
        "furtherAspects": [
            [
                1,
                "Use your own resources to help you make progress. Be prepared to make an effort to do whatever is necessary. Do not try to take short cuts. "
            ],
            [
                2,
                "Do not judge by appearances. Unless a decorative appearance is an outward sign of inner beauty, it is merely shallow and superficial. What matters now is not the outward form but theunderlying worth. "
            ],
            [
                3,
                "When everything is going relatively well, take care not to become lazy or neglect your responsibilities. Do not lose sight of your goals."
            ],
            [
                4,
                "Honesty and simplicity are what matter most now. Deep and true friendship with someone loyal and trustworthy is far more important than chasing after the glittering prizes of life."
            ],
            [
                5,
                "All that matters is to be sincere. Your material resources may not be extensive but it is who you are that counts. Others will recognize your true worth."
            ],
            [
                6,
                "Be simple and straightforward in all you say and do. You have no need to hide, pretend or put on a show. Just be true to yourself, let your value speak for itself and everything will happen in exactly the right way."
            ]
        ]
    },
    {
        "number": 23,
        "pattern": "000001",
        "name": {
            "chinese": "剝",
            "pinyin": "bō",
            "english": "Doing Away With the Old"
        },
        "symbol": "䷖",
        "quote": "The old order changeth, yielding place to new,\nAnd God fulfils himself in many ways.",
        "quoteAuthor": "Alfred, Lord Tennyson, The Passing of Arthur",
        "desc": "The situation is deteriorating. Things are collapsing around you. This is a matter of external conditions beyond your control. It is not a result of your having done anything wrong. What it means is that some aspect of your life which has until now been important no longer serves your best interests. It belongs to the cycle which is coming to an end. Because a new situation needs to come into being, the old has to die. Trying to struggle against the odds would therefore be pointless. Avoid confrontation. The consequences could be devastating. There is simply too much going against you. Try to stay detached. You are already vulnerable. Emotional involvement will only weaken you further. Whereas by remaining cool and disinterested, you will give nobody the opportunity to undermine you. Keep a low profile and bide your time. Take comfort from the fact that the current process is unavoidable, if painful. It has to run its course before conditions can take a turn for the better.",
        "descPersonal": "As there is no action you can take to improve matters, use this time to replenish your energies. In due course, you will need firm foundations on which to build the new situation. You can begin creating them now. Start building up your strength. Do not allow yourself to become depressed. Avoid any tendency to cling to the past. You can only go forward from here. Try not to have expectations of others. Take no part in power struggles. Do nothing which would compromise your sense of your own worth. Be patient. Resist any pressure to try and make things happen. Wherever possible, be kind and generous. The attitude which will best serve you is what the Chinese call wu wei. It means ‘going with the flow’ and involves trusting that matters will work themselves out as they are meant to without your having to intervene.",
        "furtherAspects": [
            [
                1,
                "Someone or something is working to undermine your position. Since this involves people you think you can rely on, you must be very cautious. At this point, there is nothing you can do except be on your guard and wait until the situation becomes clearer."
            ],
            [
                2,
                "You are in a difficult position and must be careful. Do not be stubborn. Distance yourself from unsupportive people. You have nothing to gain by remaining in a situation which does not serve your best interests."
            ],
            [
                3,
                "Circumstances are such that you are unavoidably involved in a negative situation. Stick to your principles. Honour your own values and do nothing which would go against your conscience. If others choose to behave in a despicable manner, that is their affair. By refusing to identify yourself with them, you can at least retain your own light and integrity."
            ],
            [
                4,
                "You are faced with misfortune and can do nothing to avoid it. Matters have gone too far for you to be able to turn back the tide of events."
            ],
            [
                5,
                "An unfavourable situation is now beginning to change for the better. Those who have been at odds with each other decide to cooperate for their mutual benefit. Success now becomes possible."
            ],
            [
                6,
                "The situation has deteriorated as far as it can. Now the stage is set for you to embark upon a period of renewed life, hope and personal effectiveness. Surviving a very difficult time has given you great resilience. Your future success will be a direct result of the strength you acquired in the process of battling with negative forces. This illustrates the truth that evil can only survive when fed by the power of the good. If left to feed on itself, it will use up its resources and destroy itself."
            ]
        ]
    }
]